Templates/external_airfoil_static_steady/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

// 2D domain: thin in Y (single cell), extended in X (streamwise) and Z (normal)
// Based on aerofoilNACA0012_directionalRefinement tutorial pattern

vertices
(
    (-{{ domain_upstream }}  -{{ domain_span_half }}  -{{ domain_radial }}) // 0
    ( {{ domain_downstream }} -{{ domain_span_half }}  -{{ domain_radial }}) // 1
    ( {{ domain_downstream }}  {{ domain_span_half }}  -{{ domain_radial }}) // 2
    (-{{ domain_upstream }}   {{ domain_span_half }}  -{{ domain_radial }}) // 3
    (-{{ domain_upstream }}  -{{ domain_span_half }}   {{ domain_radial }}) // 4
    ( {{ domain_downstream }} -{{ domain_span_half }}   {{ domain_radial }}) // 5
    ( {{ domain_downstream }}  {{ domain_span_half }}   {{ domain_radial }}) // 6
    (-{{ domain_upstream }}   {{ domain_span_half }}   {{ domain_radial }}) // 7
);

{{- # Cell counts: streamwise and normal sized to ~4 cells per chord, 1 cell spanwise }}
{{- nx = math.ceil((domain_upstream + domain_downstream) / ref_length * 4) }}
{{- nz = math.ceil(2 * domain_radial / ref_length * 4) }}

blocks
(
    hex (0 1 2 3 4 5 6 7) ({{ nx }} 1 {{ nz }}) simpleGrading (1 1 1)
);

edges
();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    lowerWall
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
